<?
CModule::IncludeModule("iblock");

$arIBlockType = CIBlockParameters::GetIBlockTypes();

$arIBlock = array();
$iblockFilter = (
	!empty($arCurrentValues['IBLOCK_TYPE'])
	? array('TYPE' => $arCurrentValues['IBLOCK_TYPE'], 'ACTIVE' => 'Y')
	: array('ACTIVE' => 'Y')
);
$rsIBlock = CIBlock::GetList(array('SORT' => 'ASC'), $iblockFilter);
while ($arr = $rsIBlock->Fetch())
	$arIBlock[$arr['ID']] = '['.$arr['ID'].'] '.$arr['NAME'];
unset($arr, $rsIBlock, $iblockFilter);

$properties = CIBlockProperty::GetList(Array("name"=>"asc"), Array("IBLOCK_ID"=>$arCurrentValues['IBLOCK_ID']));
while ($propFields = $properties->GetNext()){
  $arProp[$propFields['CODE']] = '['.$propFields['ID'].'] '.$propFields['NAME'];
}

$arSubcategory = array(
    "11-618" => "Запчасти / Для автомобилей / Автосвет",
    "19-2855" => "Запчасти / Для автомобилей / Автомобиль на запчасти",
    "11-619" => "Запчасти / Для автомобилей / Аккумуляторы",
    "16-827" => "Запчасти / Для автомобилей / Двигатель / Блок цилиндров, головка, картер",
    "16-828" => "Запчасти / Для автомобилей / Двигатель / Вакуумная система",
    "16-829" => "Запчасти / Для автомобилей / Двигатель / Генераторы, стартеры",
    "16-830" => "Запчасти / Для автомобилей / Двигатель / Двигатель в сборе",
    "16-831" => "Запчасти / Для автомобилей / Двигатель / Катушка зажигания, свечи, электрика",
    "16-832" => "Запчасти / Для автомобилей / Двигатель / Клапанная крышка",
    "16-833" => "Запчасти / Для автомобилей / Двигатель / Коленвал, маховик",
    "16-834" => "Запчасти / Для автомобилей / Двигатель / Коллекторы",
    "16-835" => "Запчасти / Для автомобилей / Двигатель / Крепление двигателя",
    "16-836" => "Запчасти / Для автомобилей / Двигатель / Масляный насос, система смазки",
    "16-837" => "Запчасти / Для автомобилей / Двигатель / Патрубки вентиляции",
    "16-838" => "Запчасти / Для автомобилей / Двигатель / Поршни, шатуны, кольца",
    "16-839" => "Запчасти / Для автомобилей / Двигатель / Приводные ремни, натяжители",
    "16-840" => "Запчасти / Для автомобилей / Двигатель / Прокладки и ремкомплекты",
    "16-841" => "Запчасти / Для автомобилей / Двигатель / Ремни, цепи, элементы ГРМ",
    "16-842" => "Запчасти / Для автомобилей / Двигатель / Турбины, компрессоры",
    "16-843" => "Запчасти / Для автомобилей / Двигатель / Электродвигатели и компоненты",
    "11-621" => "Запчасти / Для автомобилей / Запчасти для ТО",
    "16-805" => "Запчасти / Для автомобилей / Кузов / Балки, лонжероны",
    "16-806" => "Запчасти / Для автомобилей / Кузов / Бамперы",
    "16-807" => "Запчасти / Для автомобилей / Кузов / Брызговики",
    "16-808" => "Запчасти / Для автомобилей / Кузов / Двери",
    "16-809" => "Запчасти / Для автомобилей / Кузов / Заглушки",
    "16-810" => "Запчасти / Для автомобилей / Кузов / Замки",
    "16-811" => "Запчасти / Для автомобилей / Кузов / Защита",
    "16-812" => "Запчасти / Для автомобилей / Кузов / Зеркала",
    "16-813" => "Запчасти / Для автомобилей / Кузов / Кабина",
    "16-814" => "Запчасти / Для автомобилей / Кузов / Капот",
    "16-815" => "Запчасти / Для автомобилей / Кузов / Крепления",
    "16-816" => "Запчасти / Для автомобилей / Кузов / Крылья",
    "16-817" => "Запчасти / Для автомобилей / Кузов / Крыша",
    "16-818" => "Запчасти / Для автомобилей / Кузов / Крышка, дверь багажника",
    "16-819" => "Запчасти / Для автомобилей / Кузов / Кузов по частям",
    "16-820" => "Запчасти / Для автомобилей / Кузов / Кузов целиком",
    "16-821" => "Запчасти / Для автомобилей / Кузов / Лючок бензобака",
    "16-822" => "Запчасти / Для автомобилей / Кузов / Молдинги, накладки",
    "16-823" => "Запчасти / Для автомобилей / Кузов / Пороги",
    "16-824" => "Запчасти / Для автомобилей / Кузов / Рама",
    "16-825" => "Запчасти / Для автомобилей / Кузов / Решетка радиатора",
    "16-826" => "Запчасти / Для автомобилей / Кузов / Стойка кузова",
    "11-623" => "Запчасти / Для автомобилей / Подвеска",
    "11-624" => "Запчасти / Для автомобилей / Рулевое управление",
    "11-625" => "Запчасти / Для автомобилей / Салон",
    "16-521" => "Запчасти / Для автомобилей / Система охлаждения",
    "11-626" => "Запчасти / Для автомобилей / Стекла",
    "11-627" => "Запчасти / Для автомобилей / Топливная и выхлопная системы",
    "11-628" => "Запчасти / Для автомобилей / Тормозная система",
    "11-629" => "Запчасти / Для автомобилей / Трансмиссия и привод",
    "11-630" => "Запчасти / Для автомобилей / Электрооборудование",
    "6-401" => "Запчасти / Для мототехники",
    "6-406" => "Запчасти / Для спецтехники",
    "6-411" => "Запчасти / Для водного транспорта",
    "4-943" => "Аксессуары",
    "21" => "GPS-навигаторы",
    "4-942" => "Автокосметика и автохимия",
    "20" => "Аудио- и видеотехника",
    "4-964" => "Багажники и фаркопы",
    "4-963" => "Инструменты",
    "4-965" => "Прицепы",
    "11-631" => "Противоугонные устройства / Автосигнализации",
    "11-632" => "Противоугонные устройства / Иммобилайзеры",
    "11-633" => "Противоугонные устройства / Механические блокираторы",
    "11-634" => "Противоугонные устройства / Спутниковые системы",
    "22" => "Тюнинг",
    "10-048" => "Шины, диски и колёса / Шины",
    "10-047" => "Шины, диски и колёса / Мотошины",
    "10-046" => "Шины, диски и колёса / Диски",
    "10-045" => "Шины, диски и колёса / Колёса",
    "10-044" => "Шины, диски и колёса / Колпаки",
    "6-416" => "Экипировка"
);

$arAdType = array(
    "Товар приобретен на продажу" => "Товар приобретен на продажу",
    "Товар от производителя" => "Товар от производителя"
);

$arComponentParameters = array(
   "PARAMETERS" => array(
    "IBLOCK_TYPE" => array(
        "PARENT" => "BASE",
        "NAME" => GetMessage("IBLOCK_TYPE"),
        "TYPE" => "LIST",
        "VALUES" => $arIBlockType,
        "REFRESH" => "Y",
    ),
    "IBLOCK_ID" => array(
            "PARENT" => "BASE",
            "NAME" => GetMessage("IBLOCK_IBLOCK"),
            "TYPE" => "LIST",
            "ADDITIONAL_VALUES" => "Y",
            "VALUES" => $arIBlock,
            "REFRESH" => "Y",
    ), 
    "MORE_PHOTO" => array(
        "PARENT" => "BASE",
        "NAME" => GetMessage("RICHSITE_MORE_PHOTO"),
        "TYPE" => "LIST",
        "ADDITIONAL_VALUES" => "Y",
        "VALUES" => $arProp,
        "REFRESH" => "Y",
    ),      
    "OEM" => array(
        "PARENT" => "BASE",
        "NAME" => GetMessage("RICHSITE_OEM"),
        "TYPE" => "LIST",
        "ADDITIONAL_VALUES" => "Y",
        "VALUES" => $arProp,
        "REFRESH" => "Y",
    ),      
    "CONDITION" => array(
        "PARENT" => "BASE",
        "NAME" => GetMessage("RICHSITE_CONDITION"),
        "TYPE" => "LIST",
        "ADDITIONAL_VALUES" => "Y",
        "VALUES" => $arProp,
        "REFRESH" => "Y",
    ),       
    "CML2_ARTICLE" => array(
        "PARENT" => "BASE",
        "NAME" => GetMessage("RICHSITE_CML2_ARTICLE"),
        "TYPE" => "LIST",
        "ADDITIONAL_VALUES" => "Y",
        "VALUES" => $arProp,
        "REFRESH" => "Y",
    ),        
    "PRODUCT_SUBCATEGORY" => array(
        "NAME" => GetMessage("RICHSITE_PRODUCT_SUBCATEGORY"),
        "TYPE" => "LIST",
        "ADDITIONAL_VALUES" => "Y",
        "VALUES" => $arSubcategory,
        "REFRESH" => "Y",
    ),      
    "AD_TYPE" => array(
        "NAME" => GetMessage("RICHSITE_AD_TYPE"),
        "TYPE" => "LIST",
        "ADDITIONAL_VALUES" => "Y",
        "VALUES" => $arAdType,
        "REFRESH" => "Y",
    ),
    "CONTACT_PHONE" => array(
        "NAME" => GetMessage("RICHSITE_CONTACT_PHONE"),
        "TYPE" => "STRING",
    ),
    "ADDRESS" => array(
        "NAME" => GetMessage("RICHSITE_ADDRESS"),
        "TYPE" => "STRING",
    ),   
    "QUANTITY_ALLOW" => array(
        "NAME" => GetMessage("RICHSITE_QUANTITY_ALLOW"),
        "TYPE" => "CHECKBOX",
    ),  
    "SAVED_FILE" => array(
        "NAME" => GetMessage("RICHSITE_SAVED_FILE"),
        "TYPE" => "CHECKBOX",
    ),   
   )
);
?>